Autodesk.Revit.DB.ScheduleDefinition.CanHaveEmbeddedSchedule
Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition
added.
Remarks:
Only schedules of the following categories can have an embedded
ScheduleDefinition:
Rooms
Spaces
Electrical Circuits
Duct Systems
Piping Systems
Mechanical Equipment Sets
Key schedules cannot have embedded schedules.
Returns:
True if this ScheduleDefinition can have an embedded ScheduleDefinition,
false otherwise.
Since:
2013